In [118]:
import pandas as pd
data = pd.read_csv(r"C:\Users\keert\Downloads\raw_students.csv")
data

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [119]:
import pandas as pd
data = pd.read_csv(r"C:\Users\keert\Downloads\raw_students.csv")
data

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [120]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [121]:
data.head()

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email

In [122]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [123]:
import pandas as pd
data["Age"]= pd.to_numeric(data["Age"], errors="coerce")

In [124]:
data.dtypes

StudentID      int64
Name          object
Age          float64
Gender        object
Score        float64
Email         object
dtype: object

In [125]:
data

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  20.0    male   85.0     john@example.com
1          2   Jane Smith   19.0  Female   90.0  janesmith@email.com
2          3   Bob Johnson   NaN    Male   78.0       bobj@email.com
3          4   Alice Brown  21.0  Female    NaN      alice@email.com
4          5     Chris Lee   NaN    Male   88.0          chris@email
5          6      John Doe  20.0    Male   85.0     john@example.com
6          7           NaN  22.0  Female   92.0      sarah@email.com
7          8  Michael King  23.0    Male   75.0    michael@email.com

In [126]:
data.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [127]:
data.dropna(inplace=False)

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  20.0    male   85.0     john@example.com
1          2   Jane Smith   19.0  Female   90.0  janesmith@email.com
5          6      John Doe  20.0    Male   85.0     john@example.com
7          8  Michael King  23.0    Male   75.0    michael@email.com

In [128]:
data.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [129]:
import pandas as pd
data["Age"]=data["Age"].fillna(data["Age"].mean(),inplace=True)

C:\Users\keert\AppData\Local\Temp\ipykernel_7600\671239810.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Age"]=data["Age"].fillna(data["Age"].mean(),inplace=True)

In [130]:
data

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  None    male   85.0     john@example.com
1          2   Jane Smith   None  Female   90.0  janesmith@email.com
2          3   Bob Johnson  None    Male   78.0       bobj@email.com
3          4   Alice Brown  None  Female    NaN      alice@email.com
4          5     Chris Lee  None    Male   88.0          chris@email
5          6      John Doe  None    Male   85.0     john@example.com
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  Michael King  None    Male   75.0    michael@email.com

In [131]:
data["Score"].fillna(data["Score"].median(),inplace=True)

C:\Users\keert\AppData\Local\Temp\ipykernel_7600\3130847169.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Score"].fillna(data["Score"].median(),inplace=True)

In [132]:
data

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  None    male   85.0     john@example.com
1          2   Jane Smith   None  Female   90.0  janesmith@email.com
2          3   Bob Johnson  None    Male   78.0       bobj@email.com
3          4   Alice Brown  None  Female   85.0      alice@email.com
4          5     Chris Lee  None    Male   88.0          chris@email
5          6      John Doe  None    Male   85.0     john@example.com
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  Michael King  None    Male   75.0    michael@email.com

In [133]:
data.drop_duplicates()

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  None    male   85.0     john@example.com
1          2   Jane Smith   None  Female   90.0  janesmith@email.com
2          3   Bob Johnson  None    Male   78.0       bobj@email.com
3          4   Alice Brown  None  Female   85.0      alice@email.com
4          5     Chris Lee  None    Male   88.0          chris@email
5          6      John Doe  None    Male   85.0     john@example.com
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  Michael King  None    Male   75.0    michael@email.com

In [134]:
data.Name = data.Name.str.lower()
data

   StudentID          Name   Age  Gender  Score                Email
0          1      john doe  None    male   85.0     john@example.com
1          2   jane smith   None  Female   90.0  janesmith@email.com
2          3   bob johnson  None    Male   78.0       bobj@email.com
3          4   alice brown  None  Female   85.0      alice@email.com
4          5     chris lee  None    Male   88.0          chris@email
5          6      john doe  None    Male   85.0     john@example.com
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  michael king  None    Male   75.0    michael@email.com

In [135]:
data.drop(5)

   StudentID          Name   Age  Gender  Score                Email
0          1      john doe  None    male   85.0     john@example.com
1          2   jane smith   None  Female   90.0  janesmith@email.com
2          3   bob johnson  None    Male   78.0       bobj@email.com
3          4   alice brown  None  Female   85.0      alice@email.com
4          5     chris lee  None    Male   88.0          chris@email
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  michael king  None    Male   75.0    michael@email.com

In [136]:
data.shape

(8, 6)

In [137]:
data.duplicated().sum()

0

In [138]:
data.head(10)

   StudentID          Name   Age  Gender  Score                Email
0          1      john doe  None    male   85.0     john@example.com
1          2   jane smith   None  Female   90.0  janesmith@email.com
2          3   bob johnson  None    Male   78.0       bobj@email.com
3          4   alice brown  None  Female   85.0      alice@email.com
4          5     chris lee  None    Male   88.0          chris@email
5          6      john doe  None    Male   85.0     john@example.com
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  michael king  None    Male   75.0    michael@email.com

In [139]:
data.drop_duplicates("Name")

   StudentID          Name   Age  Gender  Score                Email
0          1      john doe  None    male   85.0     john@example.com
1          2   jane smith   None  Female   90.0  janesmith@email.com
2          3   bob johnson  None    Male   78.0       bobj@email.com
3          4   alice brown  None  Female   85.0      alice@email.com
4          5     chris lee  None    Male   88.0          chris@email
6          7           NaN  None  Female   92.0      sarah@email.com
7          8  michael king  None    Male   75.0    michael@email.com

In [140]:
data["Gernder"] = data["Gender"].str.capitalize()

In [141]:
data

   StudentID          Name   Age  Gender  Score                Email Gernder
0          1      john doe  None    male   85.0     john@example.com    Male
1          2   jane smith   None  Female   90.0  janesmith@email.com  Female
2          3   bob johnson  None    Male   78.0       bobj@email.com    Male
3          4   alice brown  None  Female   85.0      alice@email.com  Female
4          5     chris lee  None    Male   88.0          chris@email    Male
5          6      john doe  None    Male   85.0     john@example.com    Male
6          7           NaN  None  Female   92.0      sarah@email.com  Female
7          8  michael king  None    Male   75.0    michael@email.com    Male

In [142]:
data["Name"] = data["Name"].str.capitalize()

In [143]:
data

   StudentID          Name   Age  Gender  Score                Email Gernder
0          1      John doe  None    male   85.0     john@example.com    Male
1          2   jane smith   None  Female   90.0  janesmith@email.com  Female
2          3   Bob johnson  None    Male   78.0       bobj@email.com    Male
3          4   Alice brown  None  Female   85.0      alice@email.com  Female
4          5     Chris lee  None    Male   88.0          chris@email    Male
5          6      John doe  None    Male   85.0     john@example.com    Male
6          7           NaN  None  Female   92.0      sarah@email.com  Female
7          8  Michael king  None    Male   75.0    michael@email.com    Male

In [144]:
data["Gernder"] = data["Gender"].str.capitalize()

In [145]:
data

   StudentID          Name   Age  Gender  Score                Email Gernder
0          1      John doe  None    male   85.0     john@example.com    Male
1          2   jane smith   None  Female   90.0  janesmith@email.com  Female
2          3   Bob johnson  None    Male   78.0       bobj@email.com    Male
3          4   Alice brown  None  Female   85.0      alice@email.com  Female
4          5     Chris lee  None    Male   88.0          chris@email    Male
5          6      John doe  None    Male   85.0     john@example.com    Male
6          7           NaN  None  Female   92.0      sarah@email.com  Female
7          8  Michael king  None    Male   75.0    michael@email.com    Male

In [155]:
data["Email"]=data["Email"].str.contains(r".com")

In [156]:
data

   StudentID          Name   Age  Gender  Score  Email Gernder
0          1      John doe  None    male   85.0   True    Male
1          2   jane smith   None  Female   90.0   True  Female
2          3   Bob johnson  None    Male   78.0   True    Male
3          4   Alice brown  None  Female   85.0   True  Female
4          5     Chris lee  None    Male   88.0  False    Male
5          6      John doe  None    Male   85.0   True    Male
6          7           NaN  None  Female   92.0   True  Female
7          8  Michael king  None    Male   75.0   True    Male

In [3]:
import pandas as pd
data = pd.read_csv(r"C:\Users\keert\Downloads\customer_order.csv")

In [4]:
data

    Order_ID Customer_Name Product  Quantity    Price
0        101          Amit  Laptop       1.0  50000.0
1        102          Riya  Mobile       2.0  15000.0
2        103          John  Tablet       NaN  20000.0
3        104          Sara  Laptop       1.0  52000.0
4        105          Amit  Mobile       3.0      NaN
5        106         Kiran  Tablet       2.0  21000.0
6        103          John  Tablet       NaN  20000.0
7        107          Neha  Laptop       1.0  48000.0
8        108         Pooja  Mobile       2.0  16000.0
9        109          Ravi  Laptop       1.0      NaN
10       103          John  Tablet       NaN  20000.0